app/controllers/bears_controller.rb

  def create
    @bear = Bear.new( bear_params )
    if @bear.save
---
INSERT INTO "bears" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bear 1"], ["description", "A Grizzly"], ["created_at", "2016-02-01 16:44:42.121779"], ["updated_at", "2016-02-01 16:44:42.121779"]]

  def index
    @bears = Bear.all
---
SELECT "bears".* FROM "bears"

  def show
    @bear = Bear.find( params[:id] )
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @bear = Bear.find( params[:id] )
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @bear = Bear.find( params[:id] )
    if @bear.update( bear_params )
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "bears" SET "name" = ?, "updated_at" = ? WHERE "bears"."id" = ?  [["name", "Billy"], ["updated_at", "2016-02-01 16:47:57.116758"], ["id", 2]]

  def destroy
    @bear = Bear.find( params[:id] )
    if @bear.destroy
---
SELECT  "bears".* FROM "bears" WHERE "bears"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "bears" WHERE "bears"."id" = ?  [["id", 2]]